org/test.org
#+title: Example Post
#+date: <2022-01-27 Thu 13:49>
#+hugo_base_dir: ../
#+hugo_section: post
#+hugo_type: post
#+HUGO_CUSTOM_FRONT_MATTER: :tikzjax true
#+hugo_lastmod: <2022-01-28 Fri 14:00>
#+hugo_tags: test example "syntax highlighting"

#+description: This post is an example of org-mode syntax highlighting being exported to hugo markdown.

* Markup
Is this *bold*? Is this /italic/? Is this _underlined_? Is this =verbatim=? Is this ~code~? Is this +struck through+?

* Special Blocks
#+begin_mark
This is an example custom block.
#+end_mark

** TODO Details
Details are nice.




* Source Code
** Elisp
#+begin_src elisp
(defun get-things-working ()
"Get things working!"
(and (my-custom-function) (another-function)))
#+end_src

** Latex
#+begin_src latex
\begin{document}
\titlepage
\end{document}
#+end_src



* LaTeX Highlighting
Examples of inline math formulae: $\rm{ax^{2}+bx+c}$, \(\rm{p \  \to q \lor r}\).

Examples of block equations:

$$
\rm{
p \to q \lor r
}
$$



* TikzJax Rendered SVGs
Here's a picture of a circle.
<<circle>>
#+attr_html: :caption A cool circle.
#+begin_tikzjax
\draw[red] (0,0) circle (1in);
#+end_tikzjax

A link to the [[circle][circle]].
